{
  "class_name": "Model",
  "config": {
    "name": "model_9",
    "layers": [
      {
        "name": "input_9",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32,
            32,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_9"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_313",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_313",
          "trainable": true,
          "filters": 16,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_313",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_313",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_313",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_321",
        "class_name": "Activation",
        "config": {
          "name": "activation_321",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_313",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_314",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_314",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_321",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_115",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_115",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_314",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_289",
        "class_name": "Merge",
        "config": {
          "name": "merge_289",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "conv2d_313",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_115",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_314",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_314",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_289",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_322",
        "class_name": "Activation",
        "config": {
          "name": "activation_322",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_314",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_315",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_315",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_322",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_116",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_116",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_315",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_290",
        "class_name": "Merge",
        "config": {
          "name": "merge_290",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_289",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_116",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_315",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_315",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_290",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_323",
        "class_name": "Activation",
        "config": {
          "name": "activation_323",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_315",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_316",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_316",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_323",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_117",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_117",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_316",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_291",
        "class_name": "Merge",
        "config": {
          "name": "merge_291",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_290",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_117",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_316",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_316",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_291",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_324",
        "class_name": "Activation",
        "config": {
          "name": "activation_324",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_316",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_317",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_317",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_324",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_118",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_118",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_317",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_292",
        "class_name": "Merge",
        "config": {
          "name": "merge_292",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_291",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_118",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_317",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_317",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_292",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_325",
        "class_name": "Activation",
        "config": {
          "name": "activation_325",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_317",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_318",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_318",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_325",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_119",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_119",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_318",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_293",
        "class_name": "Merge",
        "config": {
          "name": "merge_293",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_292",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_119",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_318",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_318",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_293",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_326",
        "class_name": "Activation",
        "config": {
          "name": "activation_326",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_318",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_319",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_319",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_326",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_120",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_120",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_319",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_294",
        "class_name": "Merge",
        "config": {
          "name": "merge_294",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_293",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_120",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_319",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_319",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_294",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_327",
        "class_name": "Activation",
        "config": {
          "name": "activation_327",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_319",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_320",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_320",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_327",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_121",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_121",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_320",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_295",
        "class_name": "Merge",
        "config": {
          "name": "merge_295",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_294",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_121",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_320",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_320",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_295",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_328",
        "class_name": "Activation",
        "config": {
          "name": "activation_328",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_320",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_321",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_321",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_328",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_122",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_122",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_321",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_296",
        "class_name": "Merge",
        "config": {
          "name": "merge_296",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_295",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_122",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_321",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_321",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_296",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_329",
        "class_name": "Activation",
        "config": {
          "name": "activation_329",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_321",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_322",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_322",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_329",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_123",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_123",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_322",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_297",
        "class_name": "Merge",
        "config": {
          "name": "merge_297",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_296",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_123",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_322",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_322",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_297",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_330",
        "class_name": "Activation",
        "config": {
          "name": "activation_330",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_322",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_323",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_323",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_330",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_124",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_124",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_323",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_298",
        "class_name": "Merge",
        "config": {
          "name": "merge_298",
          "mode": "concat",
          "mode_type": "raw",
          "concat_axis": -1,
          "dot_axes": -1,
          "output_shape": null,
          "output_shape_type": "raw",
          "output_mask": null,
          "output_mask_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "merge_297",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ],
            [
              "dropout_124",
              0,
              0,
              {
                "mask": [
                  null,
                  null
                ]
              }
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_323",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_323",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "merge_298",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_331",
        "class_name": "Activation",
        "config": {
          "name": "activation_331",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_323",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_324",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_324",
          "trainable": true,
          "filters": 12,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_331",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_125",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_125",
          "trainable": true,
          "rate": 0.2
        },
        "inbound_nodes": [
          [
            [
              "conv2d_324",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "merge_299",
        "class_name": "Merge",
        "config": {
          "name": "merge_299",
          "mode": "concat",
          "mode_type": "raw",
